Revit 2027 API
CurvedEdgeConditionParam Enumeration
 The allowed values for the HOST_SSE_CURVED_EDGE_CONDITION_PARAM parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CurvedEdgeConditionParam
Public Enumeration CurvedEdgeConditionParam
public enum class CurvedEdgeConditionParam
type CurvedEdgeConditionParam
Members
Member name | Value | Description
ConformToCurve | 1 |  Conform to curve
NotApplicable | 0 |  Not Applicable
ProjectToSideFace | 2 |  Project to side
See Also
Reference
Autodesk.Revit.DB Namespace